---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralDisplayInHiddenViewsFraming
source: html/d9e13e98-815d-4870-64e8-b2cfaaec9888.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralDisplayInHiddenViewsFraming Property

"Display in Hidden Views"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralDisplayInHiddenViewsFraming { get; }
```